mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32L4xx_DFP</name>
  <description>STMicroelectronics STM32L4 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="2.2.0" date="2019-01-11">
      Corrected: launching STM32CubeMX via "play" button for existing projects overwrites with a new STM32CubeMX project file instead of loading it.
      CMSIS Driver:
      - SPI: Removed __HAL_SPI_ENABLE from SPI_Control function.
    </release>
    <release version="2.1.0" date="2018-12-18">
      This DFP requires STM32CubeMX V5.0 and STM32Cube_FW_L4 V1.13.0 or higher to be installed.
      This pack only contains 'Drivers', 'Documentation' and 'Fonts' from Firmware Library pack.
      New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' for configuration of pins and clocks.
      Device support:
      - Added STM32L412, STM32L422 device support.
      - Added some STM32L4R device variants.
      - Added STM32L4R 1024KB Flash variants.
      - Added device STM32L496VE.
      - Corrected dbgconf file selection.
      CMSIS Driver:
      - SPI: Corrected Slave select handling.
      - USART: Corrected UARTx/USARTx related typing mistakes.
      - USB Device: 
      -- Updated to be compliant with HAL Driver version 1.9.0.
      -- USB Device: Corrected transmitted count for non-control IN endpoints.
      - USB Host: Corrected Device Family name in USBH CMSIS driver description.
      STM32CubeMX integration - MX_Device.h generation:
      - Updated parsing of USART virtual mode.
      - Updated generation of macros: Added handling for '(' and ')' symbols.
      Board example projects:
      - Updated Blinky example projects.
      - Updated board support LED_*.c files.
    </release>
    <release version="2.0.0" date="2017-10-06">
      This DFP requires STM32CubeMX V4.22.1 and STM32Cube_FW_L4 V1.9.0 or higher to be installed.
      Reduced overall pack size by extracting only 'Drivers', 'Documentation' and 'Fonts' from Firmware Library pack.
      Updated documentation for STM32Cube Framework usage.
      - New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' for configuration of pins and clocks.
      Device support:
      - Added STM32L4Rx, STM32L4Sx device support.
      CMSIS Driver:
      - Added USART driver.
      - Added SPI driver.
      - Added USB Host and Device drivers without CMSIS-RTOS dependency.
      Example projects:
      - Introducing debug and release project targets focussing on debug visibility versus application performance.
      - Added STM32L4R9I-Eval board support.
      - Updated STM32L476G-EVAL board support.
      - Updated STM32L496G-DISCO board support.
    </release>
    <release version="1.5.0" date="2017-06-19">
      Added STM32CubeMX support based on STM32Cube_FW_L4_V1.8.0
      - Removed large media files to reduce the overall pack size
      - Added a patch to stm32l4xx_hal_def.h to support ARM Compiler 6.
      Added STM32L442 basic device support.
      Added STM32L496G-Discovery Board Support:
      - Added File_Demo Example
      - Added RTOS Blinky example
      Updated documentation.
      Updated Flash Programming Algorithms.
      Updated Pack Description (pdsc)
      - Added debug sequences and debug configuration
      - Corrected SRAM1/SRAM2 settings.
    </release>
    <release version="1.4.0" date="2017-02-24">
      Added basic device support for subfamilies STM32L4A6 and STM32L496
      Updated device support files to version V1.2.0 (except subfamilies STM32L4A6, STM32L496)
      Added QUADSPI peripheral to STM32L4x2.svd, STM32L4x3.svd
    </release>
    <release version="1.3.0" date="2016-11-14">
      Added device support for subfamilies STM32L462 STM32L452, STM32L451
      Updated documentation.
    </release>
    <release version="1.2.0" date="2016-03-03">
      Added device support for subfamilies STM32L431, STM32L432, STM32L433, STM32L443
      Updated documentation.
    </release>
    <release version="1.1.0" date="2016-02-19">
      Updated device support files and documentation
    </release>
    <release version="1.0.0" date="2015-07-28">
      Initial version of STM32L4 Device Family Pack.
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32L4</keyword>
    <keyword>STM32L4xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32L4 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dclock="80000000" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <book name="Documentation/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <description>
ST has built a new architecture to reach best-in-class ultra-low-power figures thanks to its high flexibility.
STM32L4 MCUs have scored 176.7 in the standardized EEMBC ULPBench tests that compare the efficiency of ultra-low-power microcontrollers.
Moreover, the STM32L4 series shatters performance limits in the ultra-low-power world.
It delivers 100 DMIPS based on its ARM Cortex-M4 core with FPU and ST ART Accelerator at 80 MHz.

STM32L4 microcontrollers offer dynamic voltage scaling to balance power consumption with processing demand, low-power peripherals (LP UART, LP timers) available in Stop mode, safety and security features, smart and numerous peripherals, advanced and low-power analog peripherals such as op amps, comparators, LCD, 12-bit DACs and 16-bit ADCs (hardware oversampling).
      </description>

      <environment name="uv">
        <LMisc>--branchpatch=sdcomp-29491-629360</LMisc>
      </environment>

