mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
        <memory id="IRAM1"                                 start="0x20000000" size="0x0000C000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00004000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_SB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00151940.pdf" title="STM32L43xxx STM32L44xxx STM32L45xxx STM32L46xxx Reference Manual"/>
        <book name="Documentation/DM00254865.pdf" title="STM32L443xx Data Sheet"/>

        <feature type="Timer"    n="10"   m="16"/>
        <feature type="Timer"    n="1"    m="32"/>
        <feature type="ADC"      n="1"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="4"    m="11250000"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.71" m="3.60"/>

        <!-- *************************  Device 'STM32L443CC'  ***************************** -->
        <device Dname="STM32L443CC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L443CCTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L443CCUx"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32L443CCYx"> <feature type="CSP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L443RC'  ***************************** -->
        <device Dname="STM32L443RC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L443RCTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L443RCYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L443RCIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L443VC'  ***************************** -->
        <device Dname="STM32L443VC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L443VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L443VCIx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L471'  **************************** -->
      <subFamily DsubFamily="STM32L471">
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L471xx"/>
        <debug svd="CMSIS/SVD/STM32L4x1.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x1.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00018000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00149427.pdf" title="STM32L4x1 Reference Manual"/>
        <book name="Documentation/DM00149404.pdf" title="STM32L471xx Data Sheet"/>

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="2"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                   name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="2"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>

        <!-- *************************  Device 'STM32L471RC'  ***************************** -->
        <device Dname="STM32L471RC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L471RCTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L471RCYx"> <feature type="CSP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L471VC'  ***************************** -->
        <device Dname="STM32L471VC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L471VCTx"> <feature type="QFP" n="100"/> </variant>
        </device>

