mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
      <!-- ************************  Subfamily 'STM32L485'  **************************** -->
      <subFamily DsubFamily="STM32L485">
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L485xx"/>
        <debug svd="CMSIS/SVD/STM32L4x5.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00018000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00083560.pdf" title="STM32L4x5 STM32L4x6 Reference Manual"/>
        <!--book name="Documentation/DM00108833.pdf" title="STM32L486xx Data Sheet"/-->

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="2"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"               name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="2"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>

        <!-- *************************  Device 'STM32L485JG'  ***************************** -->
        <device Dname="STM32L485JG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L485JCYx"> <feature type="CSP" n="72"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L486'  **************************** -->
      <subFamily DsubFamily="STM32L486">
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L486xx"/>
        <debug svd="CMSIS/SVD/STM32L4x6.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00018000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00083560.pdf" title="STM32L4x5 STM32L4x6 Reference Manual"/>
        <book name="Documentation/DM00108833.pdf" title="STM32L486xx Data Sheet"/>

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="3"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"               name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="1"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>

        <!-- *************************  Device 'STM32L486RG'  ***************************** -->
        <device Dname="STM32L486RG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L486RGTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L486JG'  ***************************** -->
        <device Dname="STM32L486JG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L486JGYx"> <feature type="CSP" n="72"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L486VG'  ***************************** -->
        <device Dname="STM32L486VG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L486VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L486QG'  ***************************** -->
        <device Dname="STM32L486QG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L486QGIx"> <feature type="BGA" n="132"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L486ZG'  ***************************** -->
        <device Dname="STM32L486ZG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

