mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
          <variant Dvariant="STM32L462CEUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L462VE'  ***************************** -->
        <device Dname="STM32L462VE">
          <memory id="IROM1"                              start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L462VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L462VEIx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L496'  **************************** -->
      <subFamily DsubFamily="STM32L496">
        <compile define="STM32L496xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4x6.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00040000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00010000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00083560.pdf" title="STM32L4x5 STM32L4x6 Reference Manual"/>
        <book name="Documentation/DM00284211.pdf" title="STM32L496xx Data Sheet"/>

        <!-- *************************  Device 'STM32L496RG'  ***************************** -->
        <device Dname="STM32L496RG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496RGTx"><feature n="64" type="QFP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496VE'  ***************************** -->
        <device Dname="STM32L496VE">
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L496VETx"><feature n="100" type="QFP"/></variant>
          <variant Dvariant="STM32L496VEYx"><feature n="100" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496VG'  ***************************** -->
        <device Dname="STM32L496VG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496VGTx"><feature n="100" type="QFP"/></variant>
          <variant Dvariant="STM32L496VGYx"><feature n="100" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496QG'  ***************************** -->
        <device Dname="STM32L496QG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496QGIx"><feature n="132" type="BGA"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496ZG'  ***************************** -->
        <device Dname="STM32L496ZG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496ZGTx"><feature n="144" type="QFP"/></variant>
          <variant Dvariant="STM32L496ZGYx"><feature n="144" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496AG'  ***************************** -->
        <device Dname="STM32L496AG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496AGIx"><feature n="169" type="BGA"/></variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L4A6'  **************************** -->
      <subFamily DsubFamily="STM32L4A6">
        <compile define="STM32L4A6xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4x6.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00040000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00010000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00083560.pdf" title="STM32L4x5 STM32L4x6 Reference Manual"/>
        <book name="Documentation/DM00284211.pdf" title="STM32L496xx Data Sheet"/>

