mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
        <!-- *************************  Device 'STM32L4S7AI'  ***************************** -->
        <device Dname="STM32L4S7AI">
          <memory id="IROM1"                                    start="0x08000000" size="0x00200000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00200000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="0" />
          <variant Dvariant="STM32L4S7AIIx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L4S7VI'  ***************************** -->
        <device Dname="STM32L4S7VI">
          <memory id="IROM1"                                    start="0x08000000" size="0x00200000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00200000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="0" />
          <variant Dvariant="STM32L4S7VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L4S7ZI'  ***************************** -->
        <device Dname="STM32L4S7ZI">
          <memory id="IROM1"                                    start="0x08000000" size="0x00200000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00200000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="0" />
          <variant Dvariant="STM32L4S7ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32L4S9'  **************************** -->
      <subFamily DsubFamily="STM32L4S9">
        <processor  Dclock="120000000"/>
        <compile define="STM32L4S9xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4S9.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4Rx_4Sx.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x000A0000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32L4Rx_SB_OPT.FLM" start="0x1FF00000" size="0x00000014"          default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4Rx_DB_OPT.FLM" start="0x1FF00000" size="0x00000024"          default="0"/>

        <book name="Documentation/DS12024.pdf" title="STM32L4S5xx STM32L4S7xx STM32L4S9 Data Sheet"/>
        <book name="Documentation/RM0432.pdf"  title="STM32L4Rxxx and STM32L4Sxxx Reference Manual"/>

        <!-- add device features -->

        <!-- *************************  Device 'STM32L4S9AI'  ***************************** -->
        <device Dname="STM32L4S9AI">
          <memory id="IROM1"                                    start="0x08000000" size="0x00200000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00200000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="0" />
          <variant Dvariant="STM32L4S9AIIx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L4S9VI'  ***************************** -->
        <device Dname="STM32L4S9VI">
          <memory id="IROM1"                                    start="0x08000000" size="0x00200000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00200000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="0" />
          <variant Dvariant="STM32L4S9VIJx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L4S9ZI'  ***************************** -->
        <device Dname="STM32L4S9ZI">
          <memory id="IROM1"                                    start="0x08000000" size="0x00200000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00200000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="0" />
          <variant Dvariant="STM32L4S9ZJIx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32L4S9ZITx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32L4S9ZIYx"> <feature type="CSP" n="144"/> </variant>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L4">
      <description>STMicroelectronics STM32L4 Series Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4*"/>
    </condition>
    <condition id="STM32L412">
      <description>STMicroelectronics STM32L412 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L412*"/>
    </condition>
    <condition id="STM32L422">
      <description>STMicroelectronics STM32L422 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L422*"/>
    </condition>
    <condition id="STM32L431">
      <description>STMicroelectronics STM32L431 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L431*"/>
    </condition>
