mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
    <condition id="STM32L432">
      <description>STMicroelectronics STM32L432 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L432*"/>
    </condition>
    <condition id="STM32L433">
      <description>STMicroelectronics STM32L433 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L433*"/>
    </condition>
    <condition id="STM32L442">
      <description>STMicroelectronics STM32L442 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L442*"/>
    </condition>
    <condition id="STM32L443">
      <description>STMicroelectronics STM32L443 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L443*"/>
    </condition>
    <condition id="STM32L471">
      <description>STMicroelectronics STM32L471 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L471*"/>
    </condition>
    <condition id="STM32L475">
      <description>STMicroelectronics STM32L475 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L475*"/>
    </condition>
    <condition id="STM32L476">
      <description>STMicroelectronics STM32L476 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L476*"/>
    </condition>
    <condition id="STM32L485">
      <description>STMicroelectronics STM32L485 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L485*"/>
    </condition>
    <condition id="STM32L486">
      <description>STMicroelectronics STM32L486 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L486*"/>
    </condition>
    <condition id="STM32L451">
      <description>STMicroelectronics STM32L451 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L451*"/>
    </condition>
    <condition id="STM32L452">
      <description>STMicroelectronics STM32L452 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L452*"/>
    </condition>
    <condition id="STM32L462">
      <description>STMicroelectronics STM32L462 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L462*"/>
    </condition>
    <condition id="STM32L4A6">
      <description>STMicroelectronics STM32L4A6 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4A6*"/>
    </condition>
    <condition id="STM32L496">
      <description>STMicroelectronics STM32L496 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L496*"/>
    </condition>
    <condition id="STM32L4R5">
      <description>STMicroelectronics STM32L4R5 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4R5*"/>
    </condition>
    <condition id="STM32L4R7">
      <description>STMicroelectronics STM32L4R7 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4R7*"/>
    </condition>
    <condition id="STM32L4R9">
      <description>STMicroelectronics STM32L4R9 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4R9*"/>
    </condition>
    <condition id="STM32L4S5">
      <description>STMicroelectronics STM32L4S5 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4S5*"/>
    </condition>
    <condition id="STM32L4S7">
      <description>STMicroelectronics STM32L4S7 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4S7*"/>
    </condition>
    <condition id="STM32L4S9">
      <description>STMicroelectronics STM32L4S9 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4S9*"/>
    </condition>

    <condition id="STM32L412_422">
      <description>STMicroelectronics STM32L412/422 Series devices</description>
      <accept  condition="STM32L412"/>
      <accept  condition="STM32L422"/>
    </condition>
    <condition id="STM32L4A6_4R5_4R7_4R9_4S5_4S7_4S9">
      <description>STMicroelectronics STM32L4A6/4R5/4R7/4R9/4S5/4S7/4S9 Series devices</description>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9">
      <description>STMicroelectronics STM32L496/4A6/4R5/4R7/4R9/4S5/4S7/4S9 Series devices</description>
      <accept  condition="STM32L496"/>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L4R9_4S9">
      <description>STMicroelectronics STM32L4R9/4S9 Series devices</description>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L4R7_4R9_4S7_4S9">
      <description>STMicroelectronics STM32L4R7/4R9/4S7/4S9 Series devices</description>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L4R5_4R7_4R9_4S5_4S7_4S9">
      <description>STMicroelectronics L4R5/4R7/4R9/4S5/4S7/4S9 Series devices</description>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L422_442_443_462_485_486_4A6_4S5_4S7_4S9">
      <description>STMicroelectronics STM32L422/442/443/462/485/486/4A6/4S5/4S7/4S9 Series devices</description>
      <accept  condition="STM32L422"/>
      <accept  condition="STM32L442"/>
      <accept  condition="STM32L443"/>
      <accept  condition="STM32L462"/>
      <accept  condition="STM32L485"/>
      <accept  condition="STM32L486"/>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>      
    </condition>
    <condition id="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9">
      <description>STMicroelectronics STM32L475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9 Series devices</description>
      <accept  condition="STM32L475"/>
      <accept  condition="STM32L476"/>
      <accept  condition="STM32L485"/>
      <accept  condition="STM32L486"/>
      <accept  condition="STM32L496"/>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9">
      <description>STMicroelectronics STM32L451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9 Series Devices</description>
      <accept condition="STM32L451"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4R5"/>
      <accept condition="STM32L4R7"/>
      <accept condition="STM32L4R9"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
    </condition>
