mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"    Cversion="1.9.0" condition="STM32L4 LL">
      <description>Reset and clock control (RCC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_rcc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RNG"    Cversion="1.9.0" condition="STM32L4 LL">
      <description>Random number generator (RNG) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RNG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_rng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RTC"    Cversion="1.9.0" condition="STM32L4 LL">
      <description>Real-time clock (RTC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RTC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_rtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SDMMC"  Cversion="1.9.0" condition="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 LL">
      <description>SD/SDIO/MMC card host interface (SDMMC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SDMMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_sdmmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SPI"    Cversion="1.9.0" condition="STM32L4 LL">
      <description>Serial peripheral interface (SPI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_spi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SWPMI"  Cversion="1.9.0" condition="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6 LL">
      <description>Single Wire Protocol Master Interface (SWPMI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SWPMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_swpmi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="TIM"    Cversion="1.9.0" condition="STM32L4 LL">
      <description>Timers (TIM) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_TIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_tim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="USART"  Cversion="1.9.0" condition="STM32L4 LL">
      <description>Universal synchronous asynchronous receiver transmitter (USART) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="USB"    Cversion="1.9.0" condition="STM32L412_422_432_433_442_443_452_462_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 LL">
      <description>Universal serial bus full-speed device interface (USB) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_USB
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"  Cversion="1.9.0" condition="STM32L4">
      <description>UTILS LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_UTILS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_utils.c"/>
      </files>
    </component>
    <!-- END: STMicroelectronics STM32CubeL4 LL -->

    <!-- CMSIS drivers -->
    <component Cclass="CMSIS Driver" Cgroup="MCI"                          Capiversion="2.2.0" Cversion="1.0.0" condition="STM32L4 CMSIS_Driver MCI">
      <description>MCI Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"                          Capiversion="2.1.0" Cversion="1.2.0" condition="STM32L4 CMSIS_Driver SPI">
      <description>SPI Driver for STM32L4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART"                        Capiversion="2.1.0" Cversion="1.1.0" condition="STM32L4 CMSIS_Driver USART">
      <description>USART Driver for STM32L4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USART_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/IrDA_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32L4xx.c"/>
      </files>
    </component>
