mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
      <component Cgroup="Drivers" Csub="SRAM"               condition="STM32L476G-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen"       condition="STM32L476G-EVAL BSP TS">
        <description>Touch Screen for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="STM32L476G-EVAL LED">
      <description>LED driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L476G-EVAL/Common/LED_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="STM32L476G-EVAL Buttons">
      <description>Button driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32L476G-EVAL/Common/Buttons_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0" condition="STM32L476G-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L476G-EVAL/Common/Joystick_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32L476G-EVAL ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L476G-EVAL/Common/ADC_STM32L476G-EVAL.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32L496G_Discovery Board -->
    <bundle Cbundle="STM32L496G-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32L496G-Discovery Board</description>
      <doc>MDK/Boards/ST/STM32L496G-DISCO/Documentation/DM00353127.pdf</doc>
      <component Cgroup="Drivers" Csub="Basic I/O"     condition="STM32L496G-Discovery BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"         condition="STM32L496G-Discovery BSP Audio">
        <description>Audio for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/cs42l51/cs42l51.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Camera"        condition="STM32L496G-Discovery BSP Camera">
        <description>Camera for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_camera.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_camera.c"/>
          <file category="source" name="Drivers/BSP/Components/ov9655/ov9655.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="IDD"           condition="STM32L496G-Discovery BSP IDD">
        <description>IDD for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_idd.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"           condition="STM32L496G-Discovery BSP IO">
        <description>I/O for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_io.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD"           condition="STM32L496G-Discovery BSP LCD">
        <description>LCD for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/st7789h2/st7789h2.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI"          condition="STM32L496G-Discovery BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_qspi.c"/>
        </files>
      </component>
