mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L4xx_DFP.2.2.0.pdsc
      <component Cgroup="Drivers" Csub="OSPI-RAM"           condition="STM32L4R9I-EVAL BSP OSPI-RAM">
        <description>OSPI-RAM Flash for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_ram.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_ram.c"/>
          <!--file category="source" name="Drivers/BSP/Components/iss66wvh8m8/iss66wvh8m8.h"/-->
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RGB-LCD"            condition="STM32L4R9I-EVAL BSP RGB-LCD">
        <description>RGB-LCD for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_lcd.h"/>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_lcd.c"/>
          <!--file category="source" name="Drivers/BSP/Components/rk043fn48h/rk043fn48h.h"/-->
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RGB-TS"             condition="STM32L4R9I-EVAL BSP RGB-TS">
        <description>RGB-TS for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ts.h"/>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft5336/ft5336.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD"                 condition="STM32L4R9I-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"               condition="STM32L4R9I-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="STM32L4R9I-EVAL LED">
        <description>LED Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/LED_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="STM32L4R9I-EVAL Buttons">
        <description>Buttons Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/Buttons_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0" condition="STM32L4R9I-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/Joystick_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32L4R9I-EVAL ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/ADC_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <!-- STM32L476G-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32L476G-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32L476G-EVAL</description>
      <image small="MDK/Boards/ST/STM32L476G-EVAL/Documentation/stm32l476g-eval_small.jpg"
             large="MDK/Boards/ST/STM32L476G-EVAL/Documentation/stm32l476g-eval_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF261634" title="Web Page"/>
      <book category="schematic" name="MDK/Boards/ST/STM32L476G-EVAL/Documentation/MB1144B.pdf" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32L476G-EVAL/Documentation/DM00155732.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L476ZG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L476"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

